In [1]:
import pandas as pd

data=pd.read_csv(r"C:\Users\MRITH\Downloads\Mock_Project\Booking summary.csv")
data.head()

   Property_id        date availability price
0         2015  2019-09-10            f   NaN
1         2015  2019-09-09            f   NaN
2         2015  2019-09-08            f   NaN
3         2015  2019-09-07            f   NaN
4         2015  2019-09-06            f   NaN

In [2]:
data.shape

(8231480, 4)

In [3]:
data.tail()

         Property_id        date availability price
8231475     29809357  2018-11-11            f   NaN
8231476     29809357  2018-11-10            f   NaN
8231477     29809357  2018-11-09            f   NaN
8231478     29809357  2018-11-08            f   NaN
8231479     29809357  2018-11-07            f   NaN

In [4]:
data.dtypes

Property_id      int64
date            object
availability    object
price           object
dtype: object

In [5]:
data.duplicated().sum()

0

In [6]:
data.isnull().sum()

Property_id           0
date                  0
availability          0
price           6430639
dtype: int64

In [7]:
data['availability'] = data['availability'].map({'t': True, 'f': False})

In [8]:
data['date'] = pd.to_datetime(data['date'], format='%Y-%m-%d')

In [9]:
# data['year'] = data['date'].dt.year.astype('int16')
# data['month'] = data['date'].dt.month.astype('int8')
# data['day'] = data['date'].dt.day.astype('int8')

In [10]:
data.columns = [col.lower().replace(' ', '_') for col in data.columns]

In [11]:
data['price'] = data['price'].replace({'$': '', ' ': ''}, regex=True)
data['price'] = data['price'].replace({',': ''}, regex=True)
data['price'] = data['price'].str.strip()

In [12]:
# Remove any non-numeric characters except the decimal point
data['price'] = data['price'].str.replace(r'[^0-9.]', '', regex=True)

In [13]:
data['price'] = pd.to_numeric(data['price'], errors='coerce')
data['price']=data['price'].astype('float32')

In [14]:
data.isnull().sum()

property_id           0
date                  0
availability          0
price           6430639
dtype: int64

In [15]:
if any(data['price'] < 0):
    print("Warning: Negative price values found!")

In [16]:
data.dtypes

property_id              int64
date            datetime64[ns]
availability              bool
price                  float32
dtype: object

In [17]:
data.head()

   property_id       date  availability  price
0         2015 2019-09-10         False    NaN
1         2015 2019-09-09         False    NaN
2         2015 2019-09-08         False    NaN
3         2015 2019-09-07         False    NaN
4         2015 2019-09-06         False    NaN

In [18]:
unique_values = {col: data[col].unique() for col in data.columns}
unique_values

{'property_id': array([    2015,   158890,    38296, ..., 29801233, 29802073, 29809357],
       dtype=int64),
 'date': <DatetimeArray>
 ['2019-09-10 00:00:00', '2019-09-09 00:00:00', '2019-09-08 00:00:00',
  '2019-09-07 00:00:00', '2019-09-06 00:00:00', '2019-09-05 00:00:00',
  '2019-09-04 00:00:00', '2019-09-03 00:00:00', '2019-09-02 00:00:00',
  '2019-09-01 00:00:00',
  ...
  '2018-11-14 00:00:00', '2018-11-13 00:00:00', '2018-11-12 00:00:00',
  '2018-11-11 00:00:00', '2018-11-10 00:00:00', '2018-11-09 00:00:00',
  '2018-11-08 00:00:00', '2018-11-07 00:00:00', '2019-11-08 00:00:00',
  '2019-11-07 00:00:00']
 Length: 367, dtype: datetime64[ns],
 'availability': array([False,  True]),
 'price': array([  nan,   76.,   78.,   77.,  188.,  107.,  106.,  105.,  104.,
         100.,   98.,   97.,   95.,   94.,   96.,   93.,   91.,   90.,
          92.,   89.,   88.,   86.,   87.,   83.,   82.,   80.,   69.,
         161.,   68.,   62.,   61.,   58.,   57.,   56.,   55.,   63.,
          64.,   65.,   66.,   74.,   73.,   84.,   81.,   79.,   85.,
          75.,   72.,   50.,   26.,   30.,   36.,   39.,   29.,  119.,
          44.,   45.,  180.,   70.,   53.,   52.,   42.,   43.,   47.,
          46.,   51.,   48.,   49.,  120.,   59.,   41.,  160.,  154.,
         155.,   23.,   40.,   60.,  135.,  131.,  132.,  133.,  130.,
         129.,  149.,  169.,  229.,  289.,   34.,   35.,   54.,  200.,
         103.,  109.,  112.,  111.,  113.,  108.,  102.,  140.,  150.,
         197.,  230.,   37.,  210.,   38.,   33.,   32.,  296.,  331.,
         125.,  540.,  244.,  440.,   99.,  145.,  110.,  186.,  170.,
          67.,  208.,  207.,  204.,  202.,  198.,  233.,  232.,  196.,
         231.,  195.,  194.,  228.,  193.,  181.,  189.,  187.,  178.,
         175.,  177.,  176.,  174.,  182.,  173.,  172.,  171.,  168.,
         151.,  156.,  152.,  165.,  162.,  158.,  159.,  163.,  167.,
         153.,  157.,   25.,  300.,  375.,   28.,  490.,  101.,  144.,
         138.,  137.,  227.,  136.,  126.,  122.,  128.,  143.,  147.,
         139.,  148.,  220.,   71.,  123.,  141.,  114.,   24.,   27.,
         115.,  116.,    9.,  134.,   19.,  121.,  124.,   31.,  190.,
         222.,   20.,  185.,  127.,  205.,  260.,  288.,   18.,  255.,
         275.,  325.,  245.,  265.,  285.,  235.,  295.,  215.,  225.,
         199.,  209.,  183.,   17.,   15.,   16.,   13.,   12.,   14.,
         191.,  146.,   22.,  320.,  280.,  118.,  310.,  340.,  142.,
         250.,  455.,  117.,   21.,  329.,  399.,  650.,  330.,  450.,
         184.,  213.,  444.,  580.,  216.,  214.,  212.,  211.,  241.,
         248.,  258.,  278.,  269.,  271.,  282.,  293.,  290.,  284.,
         274.,  272.,  283.,  263.,  259.,  268.,  257.,  262.,  256.,
         266.,  254.,  252.,  253.,  264.,  270.,  273.,  236.,  226.,
         299.,  433.,  349.,  431.,  429.,  426.,  412.,  307.,  164.,
         192.,  206.,  219.,  240.,  360., 1000.,  600.,  279.,  500.,
         390.,  590.,  350., 1320.,  238.,  355.,  555.,  239., 2500.,
         218.,   11.,  616.,  657.,  653.,  612.,  649.,  609.,  646.,
         606.,  642.,  602.,  639.,  599.,  635.,  596.,  595.,  632.,
         592.,  628.,  597.,  615.,  400.,  670.,  385.,  422.,  335.,
         365.,  435.,  425.,  420.,  415.,  305.,  383.,  363.,  343.,
         334.,  304.,  311.,  309.,  303.,  292.,  267.,  243.,  423.,
         395.,  430.,  234.,  203.,  179.,  499.,  249.,  525.,  520.,
         502.,  306.,  301.,  291.,  251.,  380.,  217.,  201.,  550.,
         700.,  900., 2225.,  297.,  797.,  805.,  345.,  224.,  221.,
         247.,  246.,  359.,  695.,  495.,  406.,  485.,  407.,  410.,
         471.,  439.,  541.,  539.,  237.,  277.,  579., 1020.,  369.,
         379.,  449.,  530.,  319.,  480.,  470.,  570.,  460.,  510.,
         281.,  479.,  166.,  899., 3499., 2999., 2499., 1599., 1299.,
         223.,  625., 1900., 2000.,  370.,  750.,  302.,  242.,  549.,
         419.,  389.,  298.,  362.,  341.,  352.,  999.,  459.,  469.,
         388.,  445.,  526.,  424.,  523.,  517.,  417.,  514.,  512.,
         413.,  509.,  411.,  506.,  408.,  503.,  404.,  403.,  402.,
         401.,  467.,  436.,  409.,  405.,  441.,  487., 3000.,  466.,
         472.,   10.,  327.,  381.,  366.,  675.,  393.,  354.,  348.,
         344.,  373.,  321.,  316.,  323.,  347.,  317.,  332.,  318.,
         286.,  276.,  346., 1250., 8000., 1050.,  699.,  885.,  660.,
         690.,  505.,  326.,  453.,  421.,  339., 1200.,  432.,  261.,
         308.,  312.,  799.,  315.,  800., 1300., 1021., 1015., 1010.,
        1004.,  993.,  988.,  982.,  976.,  948.,  774.,  746.,  501.,
         475.,  478., 1875., 2374., 1790., 1890.,  287.,  515.,  645.,
        1400.,  578.,  328.,  337.,  333.,  336.,  338.,  351.,  342.,
         322.,  324.,  314.,  313.,  397.,  368.,  398.,  372.,  294.,
         353.,  358.,  356.,  371., 1800.,  888.,  720.,  845.,  594.,
         532., 1032., 1097., 1156., 1142., 1064.,  367.,  361.,  855.,
        1542., 1540.,  955.,  715., 1357.,  654.,  954.,  898.,  364.,
         387.,  416.,  386.,  623.,  548.,  725.,  760.,  764.,  667.,
        1205., 1850., 2365., 5000.,  461.,  462.,  384., 4939.,  558.,
         565.,  494.,  376.,  546.,  357.,  538., 1795.,  798.,  655.,
         377.,  378.,  611.,  608.,  605.,  598.,  588.,  585.,  567.,
         559.,  571.,  572., 1199.,  529.,  759.,  489.,  382.,  374.,
         391.,  463.,  779.,  788.,  689.,  535.,  521.,  880., 6000.,
        1500.,  414.,  486.,  468., 3006., 2989., 2972., 2956., 2939.,
        2922., 2826., 2730., 2634., 2538., 2442., 2333., 2237., 2142.,
        2046., 2170.,  458.,  895.,  989., 1650., 1450.,  985.,  859.,
         507.,  504.,  496.,  493.,  491.,  488.,  473., 1094.,  518.,
         862.,  604., 8600.,  454.,  589.,  465.,  575.,  775.,  448.,
         438.,  442.,  443.,  451.,  427.,  418.,  446., 1575., 1425.,
         975., 1350., 1163.,  863.,  825., 1013.,  638., 1125., 1275.,
        1725., 1238., 1088.,  713.,  394.,  434.,  482.,  534.,  464.,
        1100.], dtype=float32)}

In [19]:
data['price'].describe()

count    1.800841e+06
mean     8.525882e+01
std      1.824134e+02
min      9.000000e+00
25%      4.000000e+01
50%      6.000000e+01
75%      9.300000e+01
max      8.600000e+03
Name: price, dtype: float64

In [20]:
# import pandas as pd

# # Assuming 'data' is your DataFrame with the 'price' column
# # Example of creating bins for 'price'
# min_val = data['price'].min()  # Minimum price
# q1 = data['price'].quantile(0.25)  # 25th percentile
# median = data['price'].median()  # Median price
# q3 = data['price'].quantile(0.75)  # 75th percentile
# max_val = data['price'].max()  # Maximum price

# # Define bin edges for labels
# bins = [min_val, q1, median, q3, max_val, float('inf')]

# # Define the labels
# bin_labels = ['Very Low', 'Low', 'Medium', 'High', 'Very High']

# # Create bins and assign labels
# data['price_label'] = pd.cut(data['price'], bins=bins, labels=bin_labels, right=True)

# # Display the DataFrame with the new labels
# print(data[['price', 'price_label']])

In [21]:
import numpy as np
data['price'].fillna(np.nan,inplace=True)

C:\Users\MRITH\AppData\Local\Temp\ipykernel_20340\4018603020.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['price'].fillna(np.nan,inplace=True)

In [22]:
data[pd.notna(data['price'])]

         property_id       date  availability  price
128             2015 2019-05-05          True   76.0
129             2015 2019-05-04          True   76.0
130             2015 2019-05-03          True   76.0
131             2015 2019-05-02          True   76.0
132             2015 2019-05-01          True   78.0
...              ...        ...           ...    ...
8231443     29809357 2018-12-13          True   65.0
8231444     29809357 2018-12-12          True   65.0
8231445     29809357 2018-12-11          True   65.0
8231446     29809357 2018-12-10          True   65.0
8231474     29809357 2018-11-12          True   65.0

[1800841 rows x 4 columns]

In [23]:
data.dtypes

property_id              int64
date            datetime64[ns]
availability              bool
price                  float32
dtype: object

In [24]:
data.to_csv('booking_summary.csv', index=False)

In [25]:
data.shape

(8231480, 4)

In [26]:
data.size

32925920

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8231480 entries, 0 to 8231479
Data columns (total 4 columns):
 #   Column        Dtype
---  ------        -----
 0   property_id   int64
 1   date          datetime64[ns]
 2   availability  bool
 3   price         float32
dtypes: bool(1), datetime64[ns](1), float32(1), int64(1)
memory usage: 164.9 MB